[
  {
    "id": 300001,
    "name": "Антон Семенченко",
    "description": "<p>Активист сообщества автоматизаторов www.COMAQA.BY, активист сообщества «суровой» разработки C++ и co www.CoreHard.by, соучередитель компании DPI.Solutions. Менеджер в компании EPAM Systems. Более 13 лет опыта в IT, основная специализация: автоматизированное тестирование, низкоуровневая разработка на C++ и ниже. Менеджмент, продажи.</p>",
    "employer": "EPAM",
    "twitter": "https://twitter.com/comaqa",
    "photo": "http://images.contentful.com/ut4a3ciohj8i/23AdjmhKh6EY4uka6cc6mi/f8abe29396aecaa0aae20cfa70eb30bb/1901911_697550007010985_8753690125754449271_n.jpg?w=200",
    "phone": "+7-999-000-00-00",
    "email": "comaqa@gmail.com",
    "cost": "-25000"
  },
  {
    "id": 300002,
    "name": "Anton Angelov",
    "description": "Anton is a Quality Assurance Architect at Progress. He is passionate about automation testing and designing test harness and tools, having the best industry development practices in mind. Furthermore, he is an active blogger and the founder of Automate The Planet. Anton is ardent about technologies such as C#, .NET Framework, T4, WPF, SQL Server, Selenium WebDriver, Jenkins. He won MVP status at Code Project (2016) and MVB (Most Valuable Blogger) at DZone. Outside his work at Progress, Anton a trainer at ITCE where he leads trainings related to ISTQB exams. More information about Anton in his blog: <a href='http://automatetheplanet.com/about-anton-angelov/'>http://automatetheplanet.com/about-anton-angelov/</a>.",
    "employer": "Progress",
    "twitter": null,
    "photo": "http://images.contentful.com/ut4a3ciohj8i/5c1Hx70OJGmKUWCgkgA6aI/53c03904c85c7fedd793e9af97e161a7/anton-angelov-square-4.png?w=200",
    "phone": "+7-999-000-00-00",
    "email": "angelov@gmail.com",
    "cost": "-10000"
  },
  {
    "id": 300003,
    "name": "Ilari Henrik Aegerter",
    "description": "<p>Ilari Henrik Aegerter's formal studies have brought him from General Linguistics and Sociology to Software Engineering and Software Testing. He so much liked the profession that he continued to intensively work on his skills. Being a context-driven tester is the natural outcome and he believes that software testing is not a clerical job but a profession, which needs a high level of proficiency. Ilari Henrik Aegerter has 10+ years of experience in the field, coming from the medical software domain at Phonak AG and progressing to e-commerce at eBay. He is now the Managing Director of House of Test GmbH and he believes that there is still a lot of work to be done for excellent software testing.</p> <p>In 2013 he co-founded the International Society for Software Testing (ISST). He is currently president of the organization. In 2015 he was elected into the board of the Association for Software Testing (AST), where he acts as VP of Marketing. Since he likes talking, he often presents at international software testing conferences and he is also frequently invited to speak at company events. From time to time he does workshops on Software Testing, which he enjoys tremendously.</p>",
    "employer": "House of Test GmbH",
    "twitter": "https://twitter.com/ilarihenrik",
    "photo": "http://images.contentful.com/ut4a3ciohj8i/MZxG8vt6KYQ0aS0Mkw4c2/ca58fd5d4446f64502c8bfb9f0cb3d0a/Ilari_3_square_10.12.15.jpg?w=200",
    "phone": "+7-999-000-00-00",
    "email": "ilarihenrik@gmail.com",
    "cost": "-58000"
  },
  {
    "id": 300004,
    "name": "Rex Black",
    "description": "<p>With over 30 years of software and systems engineering experience, Rex Black is President of RBCS (www.rbcs-us.com), a testing leader, providing consulting, training, and expert services. RBCS has over 100 clients on six continents, spanning all areas of software and system development, from embedded systems to gaming software to banking and insurance to defense systems. Rex is the most prolific author practicing in the field of software testing today, having written 13 books (and counting). He is past President of the ISTQB and of the ASTQB, a co-author of many of the ISTQB syllabi, and Chair of the Agile Working Group.</p>",
    "employer": "RBCS",
    "twitter": "https://twitter.com/LaikaTestDog",
    "photo": "http://images.contentful.com/ut4a3ciohj8i/5Iuxvmpmko4aGwuQWsSeEy/224a3234596660832823824f8760e3cc/Rex_Black.png?w=200",
    "phone": "+7-999-000-00-00",
    "email": "rex.black@gmail.com",
    "cost": "-17850"
  }
]